// // пока тест
// // тут будут хранится готовые оформленные данные
// const products = [
//     {
//         "name": "Вытяжное устройство G2H",
//         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
//         "Art": "G2H1065",
//         "price": 12644,
//         "photo": '/photo/1.png',
//         "count": 1
//     },
//     {
//         "name": "Вытяжное устройство BXC",
//         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
//         "Art": "G2H1065",
//         "price": 12644,
//         "photo": '/photo/2.png',
//         "count": 1
//     },
//     {
//         "name": "Вытяжное устройство GHN",
//         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
//         "Art": "G2H1065",
//         "price": 12644,
//         "photo": '/photo/3.png',
//         "count": 1
//     }
// ];

// export default defineEventHandler(() => {
//     return products;
// })

// // на случай удалении при тестировании данные можно востановить от сюда 
// // {
// //         "name": "Вытяжное устройство G2H",
// //         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
// //         "Art": "G2H1065",
// //         "price": 12644,
// //         "photo": '/photo/1.png',
// //         "count": 1
// //     },
// //     {
// //         "name": "Вытяжное устройство BXC",
// //         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
// //         "Art": "G2H1065",
// //         "price": 12644,
// //         "photo": '/photo/2.png',
// //         "count": 1
// //     },
// //     {
// //         "name": "Вытяжное устройство GHN",
// //         "Specifications": "12-72/168 м3/ч / гидрорегулируемый расход / от датчика присутствия",
// //         "Art": "G2H1065",
// //         "price": 12644,
// //         "photo": '/photo/3.png',
// //         "count": 1
// //     }